pytorch_pres.org
#+PROPERTY: header-args:python :exports code :eval no-export
#+TITLE: PyTorch: Completely Uninformed Image Modelling
#+AUTHOR: Richie Morrisroe
#+OPTIONS: toc:nil
#+OPTIONS: ^:nil
* Pytorch

[[http://pytorch.org/][PyTorch]] is a framework for GPU computation in Python. It's a re-implementation of Torch, which was a project in Lua, which apparently everyone hates [fn:1]. This document
reviews PyTorch, and (perhaps more importantly) shows you how to 
apply some pretty simple CNN's and RNN's to new data. 

I think this is pretty important, as many tutorials use the same data, and I was
pretty suspicious about the insane accuracies I saw on various data-sets. 
** How do I install it?
You can go [[https://pytorch.org/get-started/locally/][here]] for instructions. I like running my stuff locally (and
have a GPU, so those are the instructions I used. )

I use conda, so that's what my instructions are based on. 
#+BEGIN_SRC sh
conda create -n pytorch
source activate pytorch
conda install pytorch torchvision cudatoolkit=9.0 -c pytorch 
conda install -c conda-forge autopep8 yapf flake8
conda install scipy numpy sklearn pandas seaborn requests  jupyter
conda install -c conda-forge scikit-image
#+END_SRC
This is for CUDA 9.0 (which must be installed), Python 3 and does
require [[https://conda.io/][Conda]]. .If you use Python, you should already be using conda
Note that the above is taking a while Like long enough that's annoying
me as I write this, but I guess that reproducibility is a harsh
mistress :/. Note that i add a bunch of other packages. These are for the venv,
so that I get all of my IDE necessities [fn:2]. 
** Basic Usage

#+BEGIN_SRC python :session
import torch as torch
import torchvision as tv
#+END_SRC

#+RESULTS:

Torch is the main package, which has loads of subpackages (autograd,
nn and more) torchvision is a collection of uilities for image
learning. It has transforms, and a dataset and model library, all of
which are really useful.

#+BEGIN_SRC python :session 
x = torch.Tensor(5, 3)
y = torch.rand(5, 3)
x + y
#+END_SRC

#+RESULTS:
: 
:  6.4246e+08  2.6495e-01  5.4472e-01
:  3.6169e-01  8.8263e-01  8.6725e-01
:  9.4068e-02         nan  2.2952e+08
:  5.5131e-02  4.3398e-01  8.6512e-01
:  8.1313e-01  3.8932e-01  6.7911e-01
: [torch.FloatTensor of size 5x3]

** Overall API
Torch: Tensor (i.e. ndarray ) library, torch.autograd has features for
 automatic differentiation, torch.nn is a neural network library,
 torch.optim has standard optimisation methods (SGD, RMSProp, etc),
 torch.multiprocessing has magical memory sharing and torch.utils
 contains loading and training utility functions. For more, check out
 their [[http://pytorch.org/about/][about page]]. We'll review a bunch of this stuff throughout this
 document.
** Sizes and Shapes

#+BEGIN_SRC python :session :results output
y = torch.randn(2, 3)
print(y.size())
# like np.shape for ndarray
#+END_SRC
So the size function is essentially equivalent to np.shape,
returning either a scalar (if vector), or a list of dimensions. 



#+RESULTS:
=torch.Size([5, 3])


** Addition Ops
#+BEGIN_SRC python :session 
x + y
z = torch.zeros([5, 3])
torch.add(x, y)
print(th.add(x, y))
torch.add(z, y, out=z)
x.add_(y)
#+END_SRC

#+RESULTS:
: 
:  6.4246e+08  7.9484e-01  1.6342e+00
:  1.0851e+00  2.6479e+00  2.6017e+00
:  2.8220e-01         nan  2.2952e+08
:  1.6539e-01  1.3020e+00  2.5954e+00
:  2.4394e+00  1.1680e+00  2.0373e+00
: [torch.FloatTensor of size 5x3]

Addition can be done in multiple ways: We can assign the value to an
out tensor as in the last example; alternatively, 
functions prepended with an _ mutate their first argument, which
is standard throughout the entire library. 

I like the underscore convention, as long as it's consistent.
Possibly a recipe for disaster if people don't know what they're doing. 

** Indexing

#+BEGIN_SRC python :session :results none :eval no
print(x[:,1])
#x[R,C]
#+END_SRC
Pytorch uses Row, Column indices, which tend to be standardised across multiple languages now. 
Note that 3d Tensors (i.e. for images) can have a minibatch dimension giving the number of observations in each minibatch.
This is normally the first dimension. 
- Numpy uses Height * Width * Colour, Torch uses Colour * Height *
  Width, which means that we  require conversion to transpose the matrices (examples
  below)
** Numpy Interaction

#+BEGIN_SRC python :session :results none
a = torch.ones(5)
print(a)
b = a.numpy()
print(b)
#+END_SRC

Conversion from and to numpy is pretty seamless (as is conversion from
gpu to cpu). 


** CUDA (yay!)

#+BEGIN_SRC python :session :results none
if torch.cuda.is_available():
    x = x.cuda()
    y = y.cuda()
    z = x + y

z_cpu = z.cpu()
#+END_SRC
If you can get CUDA to work, the above is really easy. However,
getting CUDA to work can be an exercise in frustration. You'll need
all the drivers (available from the apt repos, assuming you're using
Ubuntu). Then you need to install CUDA globally, set LD_LIBRARY_PATH
so that the conda libraries can find your CUDA, and then pray.

It's gotten better in the last year or two, but it's still painful.
It is unlikely to completely brick your machine these days [fn:3]


# - CUDA interop is easy
# - Converting back is a simple ~cpu~ call
** Autograd
#+BEGIN_SRC python :session :results none
from torch.autograd import Variable
x = Variable(torch.ones((2, 2)))
y = x + 2
print(y)
z = y * y * 3
out = z.mean()
print(z, out)
out.backward(retain_graph=True)
#+END_SRC
This is probably the coolest thing about PyTorch. It implements full
reverse mode auto-differentiation. This is done efficiently with a
combination of memoizing and recursive applications of the chain rule.
These variables are inherently stateful, and thus idempotency is not
preserved So eventually, repeated calls to backward leave you with a
constant
* Gradients
#+BEGIN_SRC python :session :results none
x = torch.randn(3, requires_grad=True)
y = x * 2
while y.data.norm() < 1000:
    y = y * 2

print(y)
gradients = torch.FloatTensor([0.1, 1.0, 0.0001])
y.backward(gradients)
print(x.grad)
#+END_SRC
* Loss Functions :noexport:

#+BEGIN_SRC python :session :results none :exports code
import torch.nn.functional as F
#+END_SRC

** Transforms
#+BEGIN_SRC python :session :results none
import torch
import torchvision
import torchvision.transforms as transforms
transform = transforms.Compose(
    [transforms.ToTensor(),
     transforms.Normalize((0.5, 0.5, 0.5),
                          (0.5, 0.5, 0.5))]

)
#+END_SRC

#+RESULTS:
| __builtins__ | __cached__ | __doc__ | __file__ | __loader__ | __name__ | __package__ | __path__ | __spec__ | absolute_import | backcompat | division | hooks | print_function | unicode_literals |

Transforms are applied at load time, so the work is spread over the
minibatches. To be fair, time loading data and transferring it to the
GPU will take most of the time anyway. 
~RandomCrop~ can be used, which is data augmentation, and can be useful
if your images can handle it [fn:4]. 
