pytorch_pres.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>PyTorch: Completely Uninformed Image Modelling</title>
<!-- 2019-03-23 Sat 20:22 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Richie Morrisroe" />
</head>
<body>
<div id="content">
<h1 class="title">PyTorch: Completely Uninformed Image Modelling</h1>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Pytorch</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="http://pytorch.org/">PyTorch</a> is a framework for GPU computation in Python. It's a re-implementation of Torch, which was a project in Lua, which apparently everyone hates <sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup>. This document
reviews PyTorch, and (perhaps more importantly) shows you how to 
apply some pretty simple CNN's and RNN's to new data. 
</p>

<p>
I think this is pretty important, as many tutorials use the same data, and I was
pretty suspicious about the insane accuracies I saw on various data-sets. 
</p>
</div>
<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> How do I install it?</h3>
<div class="outline-text-3" id="text-1-1">
<p>
You can go <a href="https://pytorch.org/get-started/locally/">here</a> for instructions. I like running my stuff locally (and
have a GPU, so those are the instructions I used. )
</p>

<p>
I use conda, so that's what my instructions are based on. 
</p>
<div class="org-src-container">

<pre class="src src-sh">conda create -n pytorch
source activate pytorch
conda install pytorch torchvision cudatoolkit=9.0 -c pytorch 
conda install -c conda-forge autopep8 yapf flake8
conda install scipy numpy sklearn pandas seaborn requests  jupyter
conda install -c conda-forge scikit-image
</pre>
</div>
<p>
This is for CUDA 9.0 (which must be installed), Python 3 and does
require <a href="https://conda.io/">Conda</a>. .If you use Python, you should already be using conda
Note that the above is taking a while Like long enough that's annoying
me as I write this, but I guess that reproducibility is a harsh
mistress :/. Note that i add a bunch of other packages. These are for the venv,
so that I get all of my IDE necessities <sup><a id="fnr.2" name="fnr.2" class="footref" href="#fn.2">2</a></sup>. 
</p>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Basic Usage</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">

<pre class="src src-python">import torch as torch
import torchvision as tv
</pre>
</div>

<p>
Torch is the main package, which has loads of subpackages (autograd,
nn and more) torchvision is a collection of uilities for image
learning. It has transforms, and a dataset and model library, all of
which are really useful.
</p>

<div class="org-src-container">

<pre class="src src-python">x = torch.Tensor(5, 3)
y = torch.rand(5, 3)
x + y
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Overall API</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Torch: Tensor (i.e. ndarray ) library, torch.autograd has features for
 automatic differentiation, torch.nn is a neural network library,
 torch.optim has standard optimisation methods (SGD, RMSProp, etc),
 torch.multiprocessing has magical memory sharing and torch.utils
 contains loading and training utility functions. For more, check out
 their <a href="http://pytorch.org/about/">about page</a>. We'll review a bunch of this stuff throughout this
 document.
</p>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Sizes and Shapes</h3>
<div class="outline-text-3" id="text-1-4">
<div class="org-src-container">

<pre class="src src-python">y = torch.randn(2, 3)
print(y.size())
# like np.shape for ndarray
</pre>
</div>
<p>
So the size function is essentially equivalent to np.shape,
returning either a scalar (if vector), or a list of dimensions. 
</p>



<p>
=torch.Size([5, 3])
</p>
</div>
</div>


<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> Addition Ops</h3>
<div class="outline-text-3" id="text-1-5">
<div class="org-src-container">

<pre class="src src-python">x + y
z = torch.zeros([5, 3])
torch.add(x, y)
print(th.add(x, y))
torch.add(z, y, out=z)
x.add_(y)
</pre>
</div>

<p>
Addition can be done in multiple ways: We can assign the value to an
out tensor as in the last example; alternatively, 
functions prepended with an _ mutate their first argument, which
is standard throughout the entire library. 
</p>

<p>
I like the underscore convention, as long as it's consistent.
Possibly a recipe for disaster if people don't know what they're doing. 
</p>
</div>
</div>

<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> Indexing</h3>
<div class="outline-text-3" id="text-1-6">
<div class="org-src-container">

<pre class="src src-python">print(x[:,1])
#x[R,C]
</pre>
</div>
<p>
Pytorch uses Row, Column indices, which tend to be standardised across multiple languages now. 
Note that 3d Tensors (i.e. for images) can have a minibatch dimension giving the number of observations in each minibatch.
This is normally the first dimension. 
</p>
<ul class="org-ul">
<li>Numpy uses Height * Width * Colour, Torch uses Colour * Height *
Width, which means that we  require conversion to transpose the matrices (examples
below)
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7"><span class="section-number-3">1.7</span> Numpy Interaction</h3>
<div class="outline-text-3" id="text-1-7">
<div class="org-src-container">

<pre class="src src-python">a = torch.ones(5)
print(a)
b = a.numpy()
print(b)
</pre>
</div>

<p>
Conversion from and to numpy is pretty seamless (as is conversion from
gpu to cpu). 
</p>
</div>
</div>


<div id="outline-container-sec-1-8" class="outline-3">
<h3 id="sec-1-8"><span class="section-number-3">1.8</span> CUDA (yay!)</h3>
<div class="outline-text-3" id="text-1-8">
<div class="org-src-container">

<pre class="src src-python">if torch.cuda.is_available():
    x = x.cuda()
    y = y.cuda()
    z = x + y

z_cpu = z.cpu()
</pre>
</div>
<p>
If you can get CUDA to work, the above is really easy. However,
getting CUDA to work can be an exercise in frustration. You'll need
all the drivers (available from the apt repos, assuming you're using
Ubuntu). Then you need to install CUDA globally, set LD_LIBRARY_PATH
so that the conda libraries can find your CUDA, and then pray.
</p>

<p>
It's gotten better in the last year or two, but it's still painful.
It is unlikely to completely brick your machine these days <sup><a id="fnr.3" name="fnr.3" class="footref" href="#fn.3">3</a></sup>
</p>
</div>
</div>
<div id="outline-container-sec-1-9" class="outline-3">
<h3 id="sec-1-9"><span class="section-number-3">1.9</span> Autograd</h3>
<div class="outline-text-3" id="text-1-9">
<div class="org-src-container">

<pre class="src src-python">from torch.autograd import Variable
x = Variable(torch.ones((2, 2)))
y = x + 2
print(y)
z = y * y * 3
out = z.mean()
print(z, out)
out.backward(retain_graph=True)
</pre>
</div>
<p>
This is probably the coolest thing about PyTorch. It implements full
reverse mode auto-differentiation. This is done efficiently with a
combination of memoizing and recursive applications of the chain rule.
These variables are inherently stateful, and thus idempotency is not
preserved So eventually, repeated calls to backward leave you with a
constant
</p>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Gradients</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">

<pre class="src src-python">x = torch.randn(3, requires_grad=True)
y = x * 2
while y.data.norm() &lt; 1000:
    y = y * 2

print(y)
gradients = torch.FloatTensor([0.1, 1.0, 0.0001])
y.backward(gradients)
print(x.grad)
</pre>
</div>
</div>
</div>
