pytorch_pres.org
** DataLoaders
#+BEGIN_SRC python :session :results none
import torch.utils.data as data
trainset = torchvision.datasets.CIFAR10(root='./data',
                                        train=True,
                                        download=True,
                                        transform=transform)

trainloader = data.DataLoader(trainset,
                                          batch_size=4,
                                          shuffle=True,
                                          num_workers=2)

testset = torchvision.datasets.CIFAR10(root='./data',
                                       train=False,
                                       download=True,
                                       transform=transform)

testloader = torch.utils.data.DataLoader(trainset,
                                         batch_size=4,
                                         shuffle=True,
                                         num_workers=2)
#+END_SRC
The same process applies to all data , ~DataLoader~ is the key class.
You need to implement __len__ and __getitem__ methods, which is perfectly
acceptable. 
But you can ignore this and implement it yourself in Python code (see text section for an example). 
** More datasets
PyTorch comes with some datasets are built in such as cifar10, 100,
MNIST and a few others. Unfortunately, this does not include ImageNet,
which is only freely available to academics. Apparently everyone's
suppposed to download it themselves, which strikes me as a little
mental. With these methods we can shuffle, alter the batch size and
launch multiple processes easily Transforms and image augmentation
methods are additionally available, and are pretty useful. Some of
this is actually in a package called ~torchvision~, which has (as the
name suggests) lots of utility functions related to vision. 

** Adding your own data (easy way)
I mostly copied from [[http://pytorch.org/tutorials/beginner/transfer_learning_tutorial.html][the transfer learning tutorial]], to be honest.
These days they have a high-faluting tutorial, but in my days (some
years ago) you had to walk to school uphill both ways, etc. The
approach relies on putting your data into specific folders (but really
this is just because I was too lazy to implement a __getitem__ method). [fn:5]
#+BEGIN_SRC sh :results none :exports code
ls -R new_photos
#+END_SRC

So the pattern is /data_dir/train/class/images
You can then use the ~datasets.ImageFolder~ dataloader

so we need a ~train~ and ~val~ folder. 
We then need folders for each class (in this case, low, medium and high).
Just to note, this would be much easier with a __getitem__ method (assuming
you know what they are), and all of this is me hacking around not knowing
to do that. 
* Loading Data
#+BEGIN_SRC python :session :results none
data_dir = 'new_photos'
dsets = { x: datasets.ImageFolder(
    os.path.join(data_dir, x),
    transform[x]) for x in ['train', 'val']}

dset_loaders = {x: torch.utils.data.DataLoader(dsets[x],
                                               batch_size=6,
                                               shuffle=True,
                                               num_workers=4)
                                for x in ['train', 'val']}
dset_sizes = {x: len(dsets[x]) for x in ['train', 'val']}
dset_classes = dsets['train'].classes
#+END_SRC
So, we just define our folder, our dataloader, and hack around the lack of
implementing a __len__ method by running a dictionary comprehension. 

** Dataloaders
When I first looked at the code above, I was horrified. It seemed far too complicated for what it did. I replaced it with this
#+BEGIN_SRC python :session :eval no
from scipy import misc
test = misc.imread("new_photos/train/high/6813074_....jpg")
#+END_SRC
However, the DataLoader solves way more problems:
  - It implements lazy-loading which is good because each image is reasonably large
  - it shuffles the data
  - It varies the batch size (which can make a big difference)
** Better dataloading
- Torch provides a ~DataSet~ class
  - Implement ~__len__~ and ~__getitem__~
** DataLoading
#+NAME: init_dataloading
#+BEGIN_SRC python :session :results none
from skimage import io, transform
from torch.utils.data import Dataset, DataLoader
class RentalsDataSetOriginal(Dataset):
    def __init__(self, csv_file, image_path, transform):
        self.data_file = pd.read_csv(csv_file)
        self.image_dir = image_path
        if transform:
            self.transform = transform

    def __len__(self):
        return len(self.data_file)
    def __getitem__(self, idx):
        row = self.data_file.iloc[idx,:]
        dclass, listing, im, split = row
        image = io.imread(os.path.join(self.image_dir,
                                       split,
                                       dclass,
                                       im)).astype('float')
        img_torch = torch.from_numpy(image)
        h, w, c = img_torch.size()
        img_rs = img_torch.view([c, h, w])
        return (img_rs, dclass)
#+END_SRC
** Getitem
#+NAME: getitem
#+BEGIN_SRC python :session :results none

#+END_SRC

#+BEGIN_SRC python :session :noweb yes
<<init_dataloading>>
<<getitem>>
#+END_SRC

#+RESULTS:
: 1.0

** Actual Neural Networks
You must implement an __init__ method, to define the structure of the
Net. You must implement a forward method. This should consist of all
of non-linearites applied to each of the input layers, and then
PyTorch handles all the backward differentiations for you (which is nice). 
** Minimal Neural Network
#+BEGIN_SRC python :tangle rent_pres.py
class Net(nn.Module):
    def __init__(self):
        super(Net, self).__init__()
        self.conv1 = nn.Conv2d(3, 48, 5)
        self.pool = nn.MaxPool2d(2, 2)
        self.conv2 = nn.Conv2d(48, 64, 5)
        self.conv3 = nn.Dropout2d()
        #honestly, I just made up these numbers
        self.fc1 = nn.Linear(64*29*29, 300)
        self.fc2 = nn.Linear(300, 120)
        self.fc3 = nn.Linear(120,3)
#+END_SRC
So the ~__init__~ method creates the structure of the net, but you
  need to provide input and output sizes. If (when) you mess this up
  (what do you mean you don't do those kinds of sums in your head?),
  comment out all of the layers after the error, and use ~x.size()~ to
  decide what to do All nets must inherit from nn.Module (or a more
  specific version).
** Forward Differentiation
#+BEGIN_SRC python :tangle rent_pres.py
    def forward(self, x):
        x = self.pool(F.relu(self.conv1(x)))
        x = self.pool(F.relu(self.conv2(x)))
        x = x.view(-1, 64 * 29 * 29) #-1 ignores the minibatch
        x = F.dropout(x, training=self.training)
        x = F.relu(self.fc1(x))
        x = F.relu(self.fc2(x))
        x = self.fc3(x)
        return x
#+END_SRC
The forward operator contains the non-linearities, and the pooling
operators. Note the training argument to dropout. The tricksy part
with -1 indicates to ignore this dimension, as it's the minibatch (as
explained above). Note also, the ReLU, otherwise known as the
simplest, most complicated thing in deep learning. It performs the
princely computation of this dire incantation
#+BEGIN_SRC python :session :results none
max(x, 0)
#+END_SRC

Amazing, isn't it? To be fair, ReLU's are way better than sigmoid
functions (which may be familiar to you from such movies as logistic
regression ), in that they don't saturate at 1. The logistic function
never goes above 1, whereas our max if positive can (theoretically, at least) 
go to Infinity [fn:6]. 

