pytorch_pres.html
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Loading Data</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">

<pre class="src src-python">data_dir = 'new_photos'
dsets = { x: datasets.ImageFolder(
    os.path.join(data_dir, x),
    transform[x]) for x in ['train', 'val']}

dset_loaders = {x: torch.utils.data.DataLoader(dsets[x],
                                               batch_size=6,
                                               shuffle=True,
                                               num_workers=4)
                                for x in ['train', 'val']}
dset_sizes = {x: len(dsets[x]) for x in ['train', 'val']}
dset_classes = dsets['train'].classes
</pre>
</div>
<p>
So, we just define our folder, our dataloader, and hack around the lack of
implementing a <span class="underline"><span class="underline">len</span></span> method by running a dictionary comprehension. 
</p>
</div>

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Dataloaders</h3>
<div class="outline-text-3" id="text-3-1">
<p>
When I first looked at the code above, I was horrified. It seemed far too complicated for what it did. I replaced it with this
</p>
<div class="org-src-container">

<pre class="src src-python">from scipy import misc
test = misc.imread("new_photos/train/high/6813074_....jpg")
</pre>
</div>
<p>
However, the DataLoader solves way more problems:
</p>
<ul class="org-ul">
<li>It implements lazy-loading which is good because each image is reasonably large
</li>
<li>it shuffles the data
</li>
<li>It varies the batch size (which can make a big difference)
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Better dataloading</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>Torch provides a <code>DataSet</code> class
<ul class="org-ul">
<li>Implement <code>__len__</code> and <code>__getitem__</code>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> DataLoading</h3>
<div class="outline-text-3" id="text-3-3">
<div class="org-src-container">

<pre class="src src-python" id="init_dataloading">from skimage import io, transform
from torch.utils.data import Dataset, DataLoader
class RentalsDataSetOriginal(Dataset):
    def __init__(self, csv_file, image_path, transform):
        self.data_file = pd.read_csv(csv_file)
        self.image_dir = image_path
        if transform:
            self.transform = transform

    def __len__(self):
        return len(self.data_file)
    def __getitem__(self, idx):
        row = self.data_file.iloc[idx,:]
        dclass, listing, im, split = row
        image = io.imread(os.path.join(self.image_dir,
                                       split,
                                       dclass,
                                       im)).astype('float')
        img_torch = torch.from_numpy(image)
        h, w, c = img_torch.size()
        img_rs = img_torch.view([c, h, w])
        return (img_rs, dclass)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> Getitem</h3>
<div class="outline-text-3" id="text-3-4">
<div class="org-src-container">

<pre class="src src-python" id="getitem"></pre>
</div>

<div class="org-src-container">

<pre class="src src-python">from skimage import io, transform
from torch.utils.data import Dataset, DataLoader
class RentalsDataSetOriginal(Dataset):
    def __init__(self, csv_file, image_path, transform):
        self.data_file = pd.read_csv(csv_file)
        self.image_dir = image_path
        if transform:
            self.transform = transform

    def __len__(self):
        return len(self.data_file)
    def __getitem__(self, idx):
        row = self.data_file.iloc[idx,:]
        dclass, listing, im, split = row
        image = io.imread(os.path.join(self.image_dir,
                                       split,
                                       dclass,
                                       im)).astype('float')
        img_torch = torch.from_numpy(image)
        h, w, c = img_torch.size()
        img_rs = img_torch.view([c, h, w])
        return (img_rs, dclass)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> Actual Neural Networks</h3>
<div class="outline-text-3" id="text-3-5">
<p>
You must implement an <span class="underline"><span class="underline">init</span></span> method, to define the structure of the
Net. You must implement a forward method. This should consist of all
of non-linearites applied to each of the input layers, and then
PyTorch handles all the backward differentiations for you (which is nice). 
</p>
</div>
</div>
<div id="outline-container-sec-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3">3.6</span> Minimal Neural Network</h3>
<div class="outline-text-3" id="text-3-6">
<div class="org-src-container">

<pre class="src src-python">class Net(nn.Module):
    def __init__(self):
        super(Net, self).__init__()
        self.conv1 = nn.Conv2d(3, 48, 5)
        self.pool = nn.MaxPool2d(2, 2)
        self.conv2 = nn.Conv2d(48, 64, 5)
        self.conv3 = nn.Dropout2d()
        #honestly, I just made up these numbers
        self.fc1 = nn.Linear(64*29*29, 300)
        self.fc2 = nn.Linear(300, 120)
        self.fc3 = nn.Linear(120,3)
</pre>
</div>
<p>
So the <code>__init__</code> method creates the structure of the net, but you
  need to provide input and output sizes. If (when) you mess this up
  (what do you mean you don't do those kinds of sums in your head?),
  comment out all of the layers after the error, and use <code>x.size()</code> to
  decide what to do All nets must inherit from nn.Module (or a more
  specific version).
</p>
</div>
</div>
<div id="outline-container-sec-3-7" class="outline-3">
<h3 id="sec-3-7"><span class="section-number-3">3.7</span> Forward Differentiation</h3>
<div class="outline-text-3" id="text-3-7">
<div class="org-src-container">

<pre class="src src-python">    def forward(self, x):
        x = self.pool(F.relu(self.conv1(x)))
        x = self.pool(F.relu(self.conv2(x)))
        x = x.view(-1, 64 * 29 * 29) #-1 ignores the minibatch
        x = F.dropout(x, training=self.training)
        x = F.relu(self.fc1(x))
        x = F.relu(self.fc2(x))
        x = self.fc3(x)
        return x
</pre>
</div>
<p>
The forward operator contains the non-linearities, and the pooling
operators. Note the training argument to dropout. The tricksy part
with -1 indicates to ignore this dimension, as it's the minibatch (as
explained above). Note also, the ReLU, otherwise known as the
simplest, most complicated thing in deep learning. It performs the
princely computation of this dire incantation
</p>
<div class="org-src-container">

<pre class="src src-python">max(x, 0)
</pre>
</div>

<p>
Amazing, isn't it? To be fair, ReLU's are way better than sigmoid
functions (which may be familiar to you from such movies as logistic
regression ), in that they don't saturate at 1. The logistic function
never goes above 1, whereas our max if positive can (theoretically, at least) 
go to Infinity <sup><a id="fnr.4" name="fnr.4" class="footref" href="#fn.4">4</a></sup>. 
</p>
</div>
</div>
