pytorch_pres.org
** Training the Model
#+BEGIN_SRC python :session :eval no
import torch.optim as optim
criterion = nn.CrossEntropyLoss()
optimiser = optim.SGD(net.parameters(), lr=0.01,
                      momentum=0.9)
tr = dset_loaders['train']
for epoch in range(10):
    for i, data in enumerate(tr, 0):
        inputs, labels = data
        inputs, labels = Variable(inputs.cuda()),
        Variable(labels.cuda())
        optimiser.zero_grad()
        outputs = net(inputs)
        loss = criterion(outputs, labels)
        _, preds = torch.max(outputs.data, 1)
        loss.backward()
        optimiser.step()
#+END_SRC
* Saving Model State
#+BEGIN_SRC python :session :eval no
dtime = str(datetime.datetime.now())
    outfilename = 'train' + "_"
    + str(epoch) +  "_"
    + dtime + ".tar"
    torch.save(net.state_dict(), outfilename)
#+END_SRC
- Useful to resume training
- Current model state can be restored into a net of exactly the same shape
- Not as important for my smaller models
- These files are huuuuuggggeeee
- So you may wish to only save whichever performs best
* Testing the Model
#+BEGIN_SRC python :session :eval no
for epoch in range(5):
    val_loss = 0.0
    val_corrects = 0
    for i, data in enumerate(val, 0):
        inputs, labels = data
        inputs, labels = Variable(inputs.cuda()),
        Variable(labels.cuda())
        outputs = net(inputs)
        loss = criterion(outputs, labels)
        _, preds = torch.max(outputs.data, 1)
        val_loss += loss.data[0]
        val_corrects += torch.sum(preds == labels.data)
        phase = 'val'
    val_epoch_loss = val_loss / dset_sizes['val']
    val_epoch_acc = val_corrects / dset_sizes['val']
    print('{} Loss: {:.4f}  Acc: {:.4f}'.format(
            phase, val_epoch_loss, val_epoch_acc))
#+END_SRC
* Playing with the Net
#+BEGIN_SRC python :session :results output
params = list(net.parameters())
print(len(params))
print(params[0].size())

#+END_SRC
#+BEGIN_SRC python :session :results none :exports code
input = Variable(torch.randn(3, 3, 48, 48))
out = net(input)
print(out)
#+END_SRC

* How did it do?
#+BEGIN_EXAMPLE
train Loss: 0.1360 Acc: 0.6742
train Loss: 0.1355 Acc: 0.6750
...
train Loss: 0.1202 Acc: 0.6966
val Loss: 0.1432  Acc: 0.6816
...
val Loss: 0.1440  Acc: 0.6810
#+END_EXAMPLE
- Training Accuracy 69% (10 epochs)
- Test Accuracy 68%
- This is OK, but given the data and the lack of any meaningful domain knowledge, I'm reasonably impressed.
- I guess what we actually need to know is what the incremental value of the image data is, relative to the rest of the data.

* Text Data
- Fortunately, the rentals dataset also has some text data
#+BEGIN_SRC python :session :results output :eval yes :exports both
import pandas as pd
text = pd.read_csv("rentals_sample_text_only.csv")
first = text.iloc[0,:]
print(list(first))
#+END_SRC

#+RESULTS:
:
: >>> >>> ["This location is one of the most sought after areas
in Manhattan Building is located on an amazing quiet tree
lined block located just steps from transportation,
restaurants, boutique shops, grocery stores***
For more info on this unit and/or others like it
please contact Bryan
449-593-7152
/ kagglemanager@renthop.com <br /><br />
Bond New York is a real estate broker that supports equal housing opportunity.<p><a  website_redacted "]

* Characters vs Words?

- Most NLP that I traditionally saw used words (and bigrams, trigrams etc) as the unit of observation
- Many deep learning approaches instead rely on characters
- Characters are much less sparse than words
- We have way more characters
- We don't understand a word as a function of its characters, so should a machine?

* Characters

- They are much less sparse
- The representation is pretty cool also
- We represent each character as a 1*N tensor for each item in the character universe
- Each word is represented as a matrix of these characters

* Preprocessing
#+BEGIN_SRC python :session
import unicodedata
import string

all_letters = string.ascii_letters + " .,;'"
n_letters = len(all_letters)

def unicode_to_ascii(s):
    return ''.join(
        c for c in unicodedata.normalize('NFD', s)
        if unicodedata.category(c) != 'Mn'
        and c in all_letters
    )


#+END_SRC
- Cultural Imperialism rocks!
- More seriously, we reduce the dimension from 90+ to 32
- This means we can handle more words and longer descriptions

* Apply to the text data
#+BEGIN_SRC python :session :tangle rnn_text.py
first = text['description']
first2 = []
char_ascii = {}
for word in first:
    for char in word:
        char = unicode_to_ascii(char.lower())
        if char not in char_ascii:
            char_ascii[char] = 1
        else:
            pass
#+END_SRC
- We need the character counts to create a mapping from characters to a 1-hot matrix
- This is necessitated by the disappointing lack of R's ~model.matrix~
- This code was also used to assess the impact of removing non-ascii chars
* Character to Index
#+BEGIN_SRC python :session
import torch
all_letters = char_ascii.keys()
letter_idx ={}
for letter in all_letters:
    if letter not in letter_idx:
        letter_idx[letter] = len(letter_idx)


def letter_to_index(letter):
    return letter_idx[letter]
#+END_SRC

- Create a dict with the key being the number of previous letters
- Use this to represent the letter as a number

* Letter/Words to Tensor
#+BEGIN_SRC python :session
def letter_to_tensor(letter):
    tensor = torch.zeros(1, len(char_ascii))
    tensor[0][letter_to_index(letter)] = 1
    return tensor

def line_to_tensor(line):
    tensor = torch.zeros(len(line), 1, len(char_ascii))
    for li, letter in enumerate(line):
        letter = unicode_to_ascii(letter.lower())
        tensor[li][0][letter_to_index(letter)] = 1
    return tensor
#+END_SRC
- Code implementation for the character and word to tensor functions
- Note that these are going to be really sparse vectors (1 non-sparse entry per row)
- torch has sparse matrix support (but it's marked as experimental)
* Bespoke Rentals Code
#+BEGIN_SRC python :session
all_categories = ['low', 'medium', 'high']
def category_from_output(output):
    top_n, top_i = output.data.topk(1)
    category_i = top_i[0][0]
    return all_categories[category_i], category_i
#+END_SRC
- We need to be able to map back from a matrix of probabilities to a class prediction
