pytorch_pres.html

<div id="outline-container-sec-3-8" class="outline-3">
<h3 id="sec-3-8"><span class="section-number-3">3.8</span> Training the Model</h3>
<div class="outline-text-3" id="text-3-8">
<div class="org-src-container">

<pre class="src src-python">import torch.optim as optim
criterion = nn.CrossEntropyLoss()
optimiser = optim.SGD(net.parameters(), lr=0.01,
                      momentum=0.9)
tr = dset_loaders['train']
for epoch in range(10):
    for i, data in enumerate(tr, 0):
        inputs, labels = data
        inputs, labels = Variable(inputs.cuda()),
        Variable(labels.cuda())
        optimiser.zero_grad()
        outputs = net(inputs)
        loss = criterion(outputs, labels)
        _, preds = torch.max(outputs.data, 1)
        loss.backward()
        optimiser.step()
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Saving Model State</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">

<pre class="src src-python">dtime = str(datetime.datetime.now())
    outfilename = 'train' + "_"
    + str(epoch) +  "_"
    + dtime + ".tar"
    torch.save(net.state_dict(), outfilename)
</pre>
</div>
<ul class="org-ul">
<li>Useful to resume training
</li>
<li>Current model state can be restored into a net of exactly the same shape
</li>
<li>Not as important for my smaller models
</li>
<li>These files are huuuuuggggeeee
</li>
<li>So you may wish to only save whichever performs best
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Testing the Model</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">

<pre class="src src-python">for epoch in range(5):
    val_loss = 0.0
    val_corrects = 0
    for i, data in enumerate(val, 0):
        inputs, labels = data
        inputs, labels = Variable(inputs.cuda()),
        Variable(labels.cuda())
        outputs = net(inputs)
        loss = criterion(outputs, labels)
        _, preds = torch.max(outputs.data, 1)
        val_loss += loss.data[0]
        val_corrects += torch.sum(preds == labels.data)
        phase = 'val'
    val_epoch_loss = val_loss / dset_sizes['val']
    val_epoch_acc = val_corrects / dset_sizes['val']
    print('{} Loss: {:.4f}  Acc: {:.4f}'.format(
            phase, val_epoch_loss, val_epoch_acc))
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Playing with the Net</h2>
<div class="outline-text-2" id="text-6">
<div class="org-src-container">

<pre class="src src-python">params = list(net.parameters())
print(len(params))
print(params[0].size())
</pre>
</div>
<div class="org-src-container">

<pre class="src src-python">input = Variable(torch.randn(3, 3, 48, 48))
out = net(input)
print(out)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> How did it do?</h2>
<div class="outline-text-2" id="text-7">
<pre class="example">
train Loss: 0.1360 Acc: 0.6742
train Loss: 0.1355 Acc: 0.6750
...
train Loss: 0.1202 Acc: 0.6966
val Loss: 0.1432  Acc: 0.6816
...
val Loss: 0.1440  Acc: 0.6810
</pre>
<ul class="org-ul">
<li>Training Accuracy 69% (10 epochs)
</li>
<li>Test Accuracy 68%
</li>
<li>This is OK, but given the data and the lack of any meaningful domain knowledge, I'm reasonably impressed.
</li>
<li>I guess what we actually need to know is what the incremental value of the image data is, relative to the rest of the data.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Text Data</h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li>Fortunately, the rentals dataset also has some text data
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python">import pandas as pd
text = pd.read_csv("rentals_sample_text_only.csv")
first = text.iloc[0,:]
print(list(first))
</pre>
</div>

<pre class="example">
&gt;&gt;&gt; &gt;&gt;&gt; ["This location is one of the most sought after areas
</pre>
<p>
in Manhattan Building is located on an amazing quiet tree
lined block located just steps from transportation,
restaurants, boutique shops, grocery stores***
For more info on this unit and/or others like it
please contact Bryan
449-593-7152
/ kagglemanager@renthop.com &lt;br /&gt;&lt;br /&gt;
Bond New York is a real estate broker that supports equal housing opportunity.&lt;p&gt;&lt;a  website_redacted "]
</p>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Characters vs Words?</h2>
<div class="outline-text-2" id="text-9">
<ul class="org-ul">
<li>Most NLP that I traditionally saw used words (and bigrams, trigrams etc) as the unit of observation
</li>
<li>Many deep learning approaches instead rely on characters
</li>
<li>Characters are much less sparse than words
</li>
<li>We have way more characters
</li>
<li>We don't understand a word as a function of its characters, so should a machine?
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> Characters</h2>
<div class="outline-text-2" id="text-10">
<ul class="org-ul">
<li>They are much less sparse
</li>
<li>The representation is pretty cool also
</li>
<li>We represent each character as a 1*N tensor for each item in the character universe
</li>
<li>Each word is represented as a matrix of these characters
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> Preprocessing</h2>
<div class="outline-text-2" id="text-11">
<div class="org-src-container">

<pre class="src src-python">import unicodedata
import string

all_letters = string.ascii_letters + " .,;'"
n_letters = len(all_letters)

def unicode_to_ascii(s):
    return ''.join(
        c for c in unicodedata.normalize('NFD', s)
        if unicodedata.category(c) != 'Mn'
        and c in all_letters
    )
</pre>
</div>
<ul class="org-ul">
<li>Cultural Imperialism rocks!
</li>
<li>More seriously, we reduce the dimension from 90+ to 32
</li>
<li>This means we can handle more words and longer descriptions
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> Apply to the text data</h2>
<div class="outline-text-2" id="text-12">
<div class="org-src-container">

<pre class="src src-python">first = text['description']
first2 = []
char_ascii = {}
for word in first:
    for char in word:
        char = unicode_to_ascii(char.lower())
        if char not in char_ascii:
            char_ascii[char] = 1
        else:
            pass
</pre>
</div>
<ul class="org-ul">
<li>We need the character counts to create a mapping from characters to a 1-hot matrix
</li>
<li>This is necessitated by the disappointing lack of R's <code>model.matrix</code>
</li>
<li>This code was also used to assess the impact of removing non-ascii chars
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-13" class="outline-2">
<h2 id="sec-13"><span class="section-number-2">13</span> Character to Index</h2>
<div class="outline-text-2" id="text-13">
<div class="org-src-container">

<pre class="src src-python">import torch
all_letters = char_ascii.keys()
letter_idx ={}
for letter in all_letters:
    if letter not in letter_idx:
        letter_idx[letter] = len(letter_idx)


def letter_to_index(letter):
    return letter_idx[letter]
</pre>
</div>

<ul class="org-ul">
<li>Create a dict with the key being the number of previous letters
</li>
<li>Use this to represent the letter as a number
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-14" class="outline-2">
<h2 id="sec-14"><span class="section-number-2">14</span> Letter/Words to Tensor</h2>
<div class="outline-text-2" id="text-14">
<div class="org-src-container">

<pre class="src src-python">def letter_to_tensor(letter):
    tensor = torch.zeros(1, len(char_ascii))
    tensor[0][letter_to_index(letter)] = 1
    return tensor

def line_to_tensor(line):
    tensor = torch.zeros(len(line), 1, len(char_ascii))
    for li, letter in enumerate(line):
        letter = unicode_to_ascii(letter.lower())
        tensor[li][0][letter_to_index(letter)] = 1
    return tensor
</pre>
</div>
<ul class="org-ul">
<li>Code implementation for the character and word to tensor functions
</li>
<li>Note that these are going to be really sparse vectors (1 non-sparse entry per row)
</li>
<li>torch has sparse matrix support (but it's marked as experimental)
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-15" class="outline-2">
<h2 id="sec-15"><span class="section-number-2">15</span> Bespoke Rentals Code</h2>
<div class="outline-text-2" id="text-15">
<div class="org-src-container">

<pre class="src src-python">all_categories = ['low', 'medium', 'high']
def category_from_output(output):
    top_n, top_i = output.data.topk(1)
    category_i = top_i[0][0]
    return all_categories[category_i], category_i
</pre>
</div>
<ul class="org-ul">
<li>We need to be able to map back from a matrix of probabilities to a class prediction
</li>
</ul>
</div>
</div>
