pytorch_pres.org
* Different Get Data Implementation
#+BEGIN_SRC python :session
import pandas as pd
textdf = pd.read_csv('rentals_text_data.csv').dropna(axis=0)
cat_to_ix = {}
for cat in all_categories:
    if cat not in cat_to_ix:
        cat_to_ix[cat] = len(cat_to_ix)
    else:
        pass

def random_row(df):
    rowrange = df.shape[0] - 1
    return df.iloc[random.randint(0, rowrange)]
#+END_SRC

* Shuffling Training Examples
#+BEGIN_SRC python :session
import random as random
from torch.autograd import Variable
def random_training_example(df):
    row = random_row(df)
    target = row['interest_level']
    text = row['description']
    catlen = len(all_categories)
    target_tensor = Variable(torch.zeros(catlen))
    idx_cat = cat_to_ix[target]
    target_tensor[idx_cat]  = 1
    words_tensor = Variable(line_to_tensor(text))
    return target, text, target_tensor, words_tensor

target, text, t_tensor, w_tensor = random_training_example(textdf)
#+END_SRC
- We return the class, the actual text
- And also the matrix representation of these two parts

* our RNN
#+BEGIN_SRC python :session
import torch.nn as nn
from torch.autograd import Variable

class RNN(nn.Module):
    def __init__(self, input_size, hidden_size, output_size):
        super(RNN, self).__init__()
        self.hidden_size = hidden_size
        self.i2h = nn.Linear(input_size + hidden_size,
                             hidden_size)
        self.i2o = nn.Linear(input_size + hidden_size,
                             output_size)

    def forward(self, input, hidden):
        combined = torch.cat((input, hidden), 1)
        hidden = self.i2h(combined)
        output = self.i2o(combined)
        return output, hidden

    def init_hidden(self):
        return Variable(torch.zeros(1, self.hidden_size))

n_hidden = 128
n_letters = len(char_ascii)
rnn = RNN(len(char_ascii), n_hidden, 3)
#+END_SRC
- Pretty simple
- Absolutely no tuning applied
* Train on one example
#+BEGIN_SRC python :session :results none :exports none
import torch.nn as nn
import torch.optim as optim
#+END_SRC
#+BEGIN_SRC python :session
optimiser = optim.SGD(rnn.parameters(), lr=0.01,
                      momentum=0.9)
criterion = nn.CrossEntropyLoss()
learning_rate = 0.005
def train(target_tensor, words_tensor):
    hidden = rnn.init_hidden()
    rnn.zero_grad()
    for i in range(words_tensor.size()[0]):
        output, hidden = rnn(words_tensor[i], hidden)
    loss = criterion(output.squeeze(),
                     target_tensor.type(torch.LongTensor))
    loss.backward() #magic
    optimiser.step()
    for p in rnn.parameters():
        #need to figure out why this is necessary
        p.data.add_(-learning_rate, p.grad.data)

    return output, loss.data[0]
#+END_SRC

* Training in a Loop
#+BEGIN_SRC python :session :exports none
print_every = 500
plot_every = 1000
current_loss = 0
all_losses = []
start = time.time()
#+END_SRC
#+BEGIN_SRC python :session
n_iters = 10000

for iter in range(1, n_iters + 1):
    category, line, category_tensor,
    line_tensor, numrow = random_training_example(textdf)
        output, loss = train(category_tensor, line_tensor)
        current_loss += loss

#+END_SRC

* Inspecting the Running Model

#+BEGIN_SRC python :session
    # Print iter number, loss, name and guess
    if iter % print_every == 0:
        guess, guess_i = category_from_output(output)
        correct = 'Y' if guess == category else 'N (%s)' % category
        print('%d %d%% (%s) %.4f %s / %s %s' % (iter, iter / n_iters * 100, time_since(start), loss, line, guess, correct))

    # Add current loss avg to list of losses
    if iter % plot_every == 0:
        all_losses.append(current_loss / plot_every)
        current_loss = 0
#+END_SRC
* Problems
- This loops through the data in a non-deterministic order
- We should probably ensure that we go through the data N*epoch times
- Additionally, we need some test data
- Fortunately, we have all of the text data available
- Unfortunately it's late Monday night now, and I won't sleep if I don't stop working :(
* Future Work

- Impelement Deconvolutional Nets/other visualisation tools to understand how the models work
- Solve the actual Kaggle problem by using an RNN over my CNN
- Add the text data, image data and structured data to an ensemble and examine overall performance
- Learn more Python

* Conclusions

- PyTorch is a powerful framework for matrix computation on the GPU
- It is deeply integrated with Python
- It's not just a set of bindings to C/C++ code
- It is really easy to install (by the standards of DL frameworks)
- You can inspect each stage of the Net really easily (as it's just Python objects)
- No weirdass errors caused by compilation!
* Further Reading
- My repo with [[https://github.com/richiemorrisroe/pytorch_presentation][code]] (currently non-functional because I need to upload)
- PyTorch [[http://pytorch.org/tutorials/][tutorials]] and [[https://github.com/pytorch/examples][examples]]
- [[pytorch.org/docs/master/torch.html][the Docs]] (these are unbelievably large)
- [[http://www.deeplearningbook.org/][The Book]] (seriously, even if you never use deep learning there's a lot of really good material there)
- Completely unrelated, but this is an amazing book on [[https://www.amazon.com/Fluent-Python-Concise-Effective-Programming/dp/1491946008][Python]]
- You should definitely read it
* Papers (horribly incomplete)

- [[https://papers.nips.cc/paper/4824-imagenet-classification-with-deep-convolutional-neural-networks][AlexNet]] - it's amazing how many new things this paper did
- [[http://www.matthewzeiler.com/wp-content/uploads/2017/07/arxive2013.pdf][Deconvolutional Nets]]
- [[https://arxiv.org/pdf/1511.06434.pdf%25C3%25AF%25C2%25BC%25E2%2580%25B0][Gneralised Adversarial Networks]]
- [[https://arxiv.org/abs/1611.03530][Rethinking Generalisation and Deep Learning]]
- [[https://arxiv.org/abs/1708.05866][Deep Reinforcement Learning]]

* Footnotes

[fn:1] except me and Yann LeCunn, apparently. 

[fn:2] how do I love thee, Emacs? 

[fn:3] I managed to break my entire GUI once. It got better though. 

[fn:4] sadly, this doesn't work for text

[fn:5] incidentally, the double-underscore methods of python are cool.
I should write about them at some point. 

[fn:6] but unfortunately not beyond

