pytorch_pres.html
<div id="outline-container-sec-16" class="outline-2">
<h2 id="sec-16"><span class="section-number-2">16</span> Different Get Data Implementation</h2>
<div class="outline-text-2" id="text-16">
<div class="org-src-container">

<pre class="src src-python">import pandas as pd
textdf = pd.read_csv('rentals_text_data.csv').dropna(axis=0)
cat_to_ix = {}
for cat in all_categories:
    if cat not in cat_to_ix:
        cat_to_ix[cat] = len(cat_to_ix)
    else:
        pass

def random_row(df):
    rowrange = df.shape[0] - 1
    return df.iloc[random.randint(0, rowrange)]
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-17" class="outline-2">
<h2 id="sec-17"><span class="section-number-2">17</span> Shuffling Training Examples</h2>
<div class="outline-text-2" id="text-17">
<div class="org-src-container">

<pre class="src src-python">import random as random
from torch.autograd import Variable
def random_training_example(df):
    row = random_row(df)
    target = row['interest_level']
    text = row['description']
    catlen = len(all_categories)
    target_tensor = Variable(torch.zeros(catlen))
    idx_cat = cat_to_ix[target]
    target_tensor[idx_cat]  = 1
    words_tensor = Variable(line_to_tensor(text))
    return target, text, target_tensor, words_tensor

target, text, t_tensor, w_tensor = random_training_example(textdf)
</pre>
</div>
<ul class="org-ul">
<li>We return the class, the actual text
</li>
<li>And also the matrix representation of these two parts
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-18" class="outline-2">
<h2 id="sec-18"><span class="section-number-2">18</span> our RNN</h2>
<div class="outline-text-2" id="text-18">
<div class="org-src-container">

<pre class="src src-python">import torch.nn as nn
from torch.autograd import Variable

class RNN(nn.Module):
    def __init__(self, input_size, hidden_size, output_size):
        super(RNN, self).__init__()
        self.hidden_size = hidden_size
        self.i2h = nn.Linear(input_size + hidden_size,
                             hidden_size)
        self.i2o = nn.Linear(input_size + hidden_size,
                             output_size)

    def forward(self, input, hidden):
        combined = torch.cat((input, hidden), 1)
        hidden = self.i2h(combined)
        output = self.i2o(combined)
        return output, hidden

    def init_hidden(self):
        return Variable(torch.zeros(1, self.hidden_size))

n_hidden = 128
n_letters = len(char_ascii)
rnn = RNN(len(char_ascii), n_hidden, 3)
</pre>
</div>
<ul class="org-ul">
<li>Pretty simple
</li>
<li>Absolutely no tuning applied
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-19" class="outline-2">
<h2 id="sec-19"><span class="section-number-2">19</span> Train on one example</h2>
<div class="outline-text-2" id="text-19">
<div class="org-src-container">

<pre class="src src-python">optimiser = optim.SGD(rnn.parameters(), lr=0.01,
                      momentum=0.9)
criterion = nn.CrossEntropyLoss()
learning_rate = 0.005
def train(target_tensor, words_tensor):
    hidden = rnn.init_hidden()
    rnn.zero_grad()
    for i in range(words_tensor.size()[0]):
        output, hidden = rnn(words_tensor[i], hidden)
    loss = criterion(output.squeeze(),
                     target_tensor.type(torch.LongTensor))
    loss.backward() #magic
    optimiser.step()
    for p in rnn.parameters():
        #need to figure out why this is necessary
        p.data.add_(-learning_rate, p.grad.data)

    return output, loss.data[0]
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-20" class="outline-2">
<h2 id="sec-20"><span class="section-number-2">20</span> Training in a Loop</h2>
<div class="outline-text-2" id="text-20">
<div class="org-src-container">

<pre class="src src-python">n_iters = 10000

for iter in range(1, n_iters + 1):
    category, line, category_tensor,
    line_tensor, numrow = random_training_example(textdf)
        output, loss = train(category_tensor, line_tensor)
        current_loss += loss
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-21" class="outline-2">
<h2 id="sec-21"><span class="section-number-2">21</span> Inspecting the Running Model</h2>
<div class="outline-text-2" id="text-21">
<div class="org-src-container">

<pre class="src src-python">    # Print iter number, loss, name and guess
    if iter % print_every == 0:
        guess, guess_i = category_from_output(output)
        correct = 'Y' if guess == category else 'N (%s)' % category
        print('%d %d%% (%s) %.4f %s / %s %s' % (iter, iter / n_iters * 100, time_since(start), loss, line, guess, correct))

    # Add current loss avg to list of losses
    if iter % plot_every == 0:
        all_losses.append(current_loss / plot_every)
        current_loss = 0
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-22" class="outline-2">
<h2 id="sec-22"><span class="section-number-2">22</span> Problems</h2>
<div class="outline-text-2" id="text-22">
<ul class="org-ul">
<li>This loops through the data in a non-deterministic order
</li>
<li>We should probably ensure that we go through the data N*epoch times
</li>
<li>Additionally, we need some test data
</li>
<li>Fortunately, we have all of the text data available
</li>
<li>Unfortunately it's late Monday night now, and I won't sleep if I don't stop working :(
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-23" class="outline-2">
<h2 id="sec-23"><span class="section-number-2">23</span> Future Work</h2>
<div class="outline-text-2" id="text-23">
<ul class="org-ul">
<li>Impelement Deconvolutional Nets/other visualisation tools to understand how the models work
</li>
<li>Solve the actual Kaggle problem by using an RNN over my CNN
</li>
<li>Add the text data, image data and structured data to an ensemble and examine overall performance
</li>
<li>Learn more Python
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-24" class="outline-2">
<h2 id="sec-24"><span class="section-number-2">24</span> Conclusions</h2>
<div class="outline-text-2" id="text-24">
<ul class="org-ul">
<li>PyTorch is a powerful framework for matrix computation on the GPU
</li>
<li>It is deeply integrated with Python
</li>
<li>It's not just a set of bindings to C/C++ code
</li>
<li>It is really easy to install (by the standards of DL frameworks)
</li>
<li>You can inspect each stage of the Net really easily (as it's just Python objects)
</li>
<li>No weirdass errors caused by compilation!
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-25" class="outline-2">
<h2 id="sec-25"><span class="section-number-2">25</span> Further Reading</h2>
<div class="outline-text-2" id="text-25">
<ul class="org-ul">
<li>My repo with <a href="https://github.com/richiemorrisroe/pytorch_presentation">code</a> (currently non-functional because I need to upload)
</li>
<li>PyTorch <a href="http://pytorch.org/tutorials/">tutorials</a> and <a href="https://github.com/pytorch/examples">examples</a>
</li>
<li><i>the Docs</i> (these are unbelievably large)
</li>
<li><a href="http://www.deeplearningbook.org/">The Book</a> (seriously, even if you never use deep learning there's a lot of really good material there)
</li>
<li>Completely unrelated, but this is an amazing book on <a href="https://www.amazon.com/Fluent-Python-Concise-Effective-Programming/dp/1491946008">Python</a>
</li>
<li>You should definitely read it
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-26" class="outline-2">
<h2 id="sec-26"><span class="section-number-2">26</span> Papers (horribly incomplete)</h2>
<div class="outline-text-2" id="text-26">
<ul class="org-ul">
<li><a href="https://papers.nips.cc/paper/4824-imagenet-classification-with-deep-convolutional-neural-networks">AlexNet</a> - it's amazing how many new things this paper did
</li>
<li><a href="http://www.matthewzeiler.com/wp-content/uploads/2017/07/arxive2013.pdf">Deconvolutional Nets</a>
</li>
<li><a href="https://arxiv.org/pdf/1511.06434.pdf%25C3%25AF%25C2%25BC%25E2%2580%25B0">Gneralised Adversarial Networks</a>
</li>
<li><a href="https://arxiv.org/abs/1611.03530">Rethinking Generalisation and Deep Learning</a>
</li>
<li><a href="https://arxiv.org/abs/1708.05866">Deep Reinforcement Learning</a>
</li>
</ul>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" name="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p class="footpara">
except me and Yann LeCunn, apparently. 
</p></div>

<div class="footdef"><sup><a id="fn.2" name="fn.2" class="footnum" href="#fnr.2">2</a></sup> <p class="footpara">
how do I love thee, Emacs? 
</p></div>

<div class="footdef"><sup><a id="fn.3" name="fn.3" class="footnum" href="#fnr.3">3</a></sup> <p class="footpara">
I managed to break my entire GUI once. It got better though. 
</p></div>

<div class="footdef"><sup><a id="fn.4" name="fn.4" class="footnum" href="#fnr.4">4</a></sup> <p class="footpara">
but unfortunately not beyond
</p></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: Richie Morrisroe</p>
<p class="date">Created: 2019-03-23 Sat 20:22</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.2.2 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
